; domain
(define (domain grid-visitAll)
(:requirements :strips :typing :negative-preconditions)
(:types
place - object
)
(:predicates
	(at-robot ?x1 - place)
	(visited ?x1 - place)
	(connected ?x1 - place ?x2 - place)
)
(:action move
	:parameters (?x1 - place ?x2 - place )
	:precondition (and
	(not(at-robot ?x2))
	(at-robot ?x1)
	(connected ?x1 ?x2))
	:effect (and
	(at-robot ?x2)
	(not(at-robot ?x1)))
)
(:action visit
	:parameters (?x1 - place )
	:precondition (and
	(at-robot ?x1)
	(not(visited ?x1)))
	:effect (and
	(visited ?x1))
)
)

; problem
(define (problem grid-5)
(:domain grid-visitAll)
(:objects
	loc-x0-y0
	loc-x0-y1
	loc-x0-y2
	loc-x0-y3
	loc-x0-y4
	loc-x1-y0
	loc-x1-y1
	loc-x1-y2
	loc-x1-y3
	loc-x1-y4
	loc-x2-y0
	loc-x2-y1
	loc-x2-y2
	loc-x2-y3
	loc-x2-y4
	loc-x3-y0
	loc-x3-y1
	loc-x3-y2
	loc-x3-y3
	loc-x3-y4
	loc-x4-y0
	loc-x4-y1
	loc-x4-y2
	loc-x4-y3
	loc-x4-y4
- place

)
(:init
	(at-robot loc-x2-y2)
	(visited loc-x2-y2)
	(connected loc-x0-y0 loc-x1-y0)
 	(connected loc-x0-y0 loc-x0-y1)
 	(connected loc-x0-y1 loc-x1-y1)
 	(connected loc-x0-y1 loc-x0-y0)
 	(connected loc-x0-y1 loc-x0-y2)
 	(connected loc-x0-y2 loc-x1-y2)
 	(connected loc-x0-y2 loc-x0-y1)
 	(connected loc-x0-y2 loc-x0-y3)
 	(connected loc-x0-y3 loc-x1-y3)
 	(connected loc-x0-y3 loc-x0-y2)
 	(connected loc-x0-y3 loc-x0-y4)
 	(connected loc-x0-y4 loc-x1-y4)
 	(connected loc-x0-y4 loc-x0-y3)
 	(connected loc-x1-y0 loc-x0-y0)
 	(connected loc-x1-y0 loc-x2-y0)
 	(connected loc-x1-y0 loc-x1-y1)
 	(connected loc-x1-y1 loc-x0-y1)
 	(connected loc-x1-y1 loc-x2-y1)
 	(connected loc-x1-y1 loc-x1-y0)
 	(connected loc-x1-y1 loc-x1-y2)
 	(connected loc-x1-y2 loc-x0-y2)
 	(connected loc-x1-y2 loc-x2-y2)
 	(connected loc-x1-y2 loc-x1-y1)
 	(connected loc-x1-y2 loc-x1-y3)
 	(connected loc-x1-y3 loc-x0-y3)
 	(connected loc-x1-y3 loc-x2-y3)
 	(connected loc-x1-y3 loc-x1-y2)
 	(connected loc-x1-y3 loc-x1-y4)
 	(connected loc-x1-y4 loc-x0-y4)
 	(connected loc-x1-y4 loc-x2-y4)
 	(connected loc-x1-y4 loc-x1-y3)
 	(connected loc-x2-y0 loc-x1-y0)
 	(connected loc-x2-y0 loc-x3-y0)
 	(connected loc-x2-y0 loc-x2-y1)
 	(connected loc-x2-y1 loc-x1-y1)
 	(connected loc-x2-y1 loc-x3-y1)
 	(connected loc-x2-y1 loc-x2-y0)
 	(connected loc-x2-y1 loc-x2-y2)
 	(connected loc-x2-y2 loc-x1-y2)
 	(connected loc-x2-y2 loc-x3-y2)
 	(connected loc-x2-y2 loc-x2-y1)
 	(connected loc-x2-y2 loc-x2-y3)
 	(connected loc-x2-y3 loc-x1-y3)
 	(connected loc-x2-y3 loc-x3-y3)
 	(connected loc-x2-y3 loc-x2-y2)
 	(connected loc-x2-y3 loc-x2-y4)
 	(connected loc-x2-y4 loc-x1-y4)
 	(connected loc-x2-y4 loc-x3-y4)
 	(connected loc-x2-y4 loc-x2-y3)
 	(connected loc-x3-y0 loc-x2-y0)
 	(connected loc-x3-y0 loc-x4-y0)
 	(connected loc-x3-y0 loc-x3-y1)
 	(connected loc-x3-y1 loc-x2-y1)
 	(connected loc-x3-y1 loc-x4-y1)
 	(connected loc-x3-y1 loc-x3-y0)
 	(connected loc-x3-y1 loc-x3-y2)
 	(connected loc-x3-y2 loc-x2-y2)
 	(connected loc-x3-y2 loc-x4-y2)
 	(connected loc-x3-y2 loc-x3-y1)
 	(connected loc-x3-y2 loc-x3-y3)
 	(connected loc-x3-y3 loc-x2-y3)
 	(connected loc-x3-y3 loc-x4-y3)
 	(connected loc-x3-y3 loc-x3-y2)
 	(connected loc-x3-y3 loc-x3-y4)
 	(connected loc-x3-y4 loc-x2-y4)
 	(connected loc-x3-y4 loc-x4-y4)
 	(connected loc-x3-y4 loc-x3-y3)
 	(connected loc-x4-y0 loc-x3-y0)
 	(connected loc-x4-y0 loc-x4-y1)
 	(connected loc-x4-y1 loc-x3-y1)
 	(connected loc-x4-y1 loc-x4-y0)
 	(connected loc-x4-y1 loc-x4-y2)
 	(connected loc-x4-y2 loc-x3-y2)
 	(connected loc-x4-y2 loc-x4-y1)
 	(connected loc-x4-y2 loc-x4-y3)
 	(connected loc-x4-y3 loc-x3-y3)
 	(connected loc-x4-y3 loc-x4-y2)
 	(connected loc-x4-y3 loc-x4-y4)
 	(connected loc-x4-y4 loc-x3-y4)
 	(connected loc-x4-y4 loc-x4-y3)

)
(:goal
(and
	(visited loc-x0-y0)
	(visited loc-x0-y1)
	(visited loc-x0-y2)
	(visited loc-x1-y0)
	(visited loc-x1-y1)
	(visited loc-x2-y0)
	(visited loc-x2-y1)
	(visited loc-x2-y2)
	(visited loc-x2-y3)
	(visited loc-x3-y0)
	(visited loc-x3-y2)
	(visited loc-x3-y4)
	(visited loc-x4-y0)
	(visited loc-x4-y3)
	(visited loc-x4-y4)
)
)
)

; plan
1. (move loc-x2-y2 loc-x2-y1)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x2-y1)
   goals met: 1 of 15
2. (move loc-x2-y1 loc-x2-y0)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x2-y0)
   goals met: 1 of 15
3. (move loc-x2-y0 loc-x3-y0)
   deleted: (at-robot loc-x2-y0)
   added: (at-robot loc-x3-y0)
   goals met: 1 of 15
4. (visit loc-x3-y0)
   added: (visited loc-x3-y0)
   goals met: 2 of 15
5. (move loc-x3-y0 loc-x2-y0)
   deleted: (at-robot loc-x3-y0)
   added: (at-robot loc-x2-y0)
   goals met: 2 of 15
6. (visit loc-x2-y0)
   added: (visited loc-x2-y0)
   goals met: 3 of 15
7. (move loc-x2-y0 loc-x2-y1)
   deleted: (at-robot loc-x2-y0)
   added: (at-robot loc-x2-y1)
   goals met: 3 of 15
8. (visit loc-x2-y1)
   added: (visited loc-x2-y1)
   goals met: 4 of 15
9. (move loc-x2-y1 loc-x1-y1)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x1-y1)
   goals met: 4 of 15
10. (move loc-x1-y1 loc-x0-y1)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x0-y1)
   goals met: 4 of 15
11. (move loc-x0-y1 loc-x0-y2)
   deleted: (at-robot loc-x0-y1)
   added: (at-robot loc-x0-y2)
   goals met: 4 of 15
12. (visit loc-x0-y2)
   added: (visited loc-x0-y2)
   goals met: 5 of 15
13. (move loc-x0-y2 loc-x0-y1)
   deleted: (at-robot loc-x0-y2)
   added: (at-robot loc-x0-y1)
   goals met: 5 of 15
14. (visit loc-x0-y1)
   added: (visited loc-x0-y1)
   goals met: 6 of 15
15. (move loc-x0-y1 loc-x1-y1)
   deleted: (at-robot loc-x0-y1)
   added: (at-robot loc-x1-y1)
   goals met: 6 of 15
16. (visit loc-x1-y1)
   added: (visited loc-x1-y1)
   goals met: 7 of 15
17. (move loc-x1-y1 loc-x1-y0)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y0)
   goals met: 7 of 15
18. (move loc-x1-y0 loc-x2-y0)
   deleted: (at-robot loc-x1-y0)
   added: (at-robot loc-x2-y0)
   goals met: 7 of 15
19. (move loc-x2-y0 loc-x3-y0)
   deleted: (at-robot loc-x2-y0)
   added: (at-robot loc-x3-y0)
   goals met: 7 of 15
20. (move loc-x3-y0 loc-x4-y0)
   deleted: (at-robot loc-x3-y0)
   added: (at-robot loc-x4-y0)
   goals met: 7 of 15
21. (visit loc-x4-y0)
   added: (visited loc-x4-y0)
   goals met: 8 of 15
22. (move loc-x4-y0 loc-x3-y0)
   deleted: (at-robot loc-x4-y0)
   added: (at-robot loc-x3-y0)
   goals met: 8 of 15
23. (move loc-x3-y0 loc-x2-y0)
   deleted: (at-robot loc-x3-y0)
   added: (at-robot loc-x2-y0)
   goals met: 8 of 15
24. (move loc-x2-y0 loc-x1-y0)
   deleted: (at-robot loc-x2-y0)
   added: (at-robot loc-x1-y0)
   goals met: 8 of 15
25. (move loc-x1-y0 loc-x1-y1)
   deleted: (at-robot loc-x1-y0)
   added: (at-robot loc-x1-y1)
   goals met: 8 of 15
26. (move loc-x1-y1 loc-x1-y2)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y2)
   goals met: 8 of 15
27. (move loc-x1-y2 loc-x2-y2)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x2-y2)
   goals met: 8 of 15
28. (move loc-x2-y2 loc-x2-y3)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x2-y3)
   goals met: 8 of 15
29. (visit loc-x2-y3)
   added: (visited loc-x2-y3)
   goals met: 9 of 15
30. (move loc-x2-y3 loc-x3-y3)
   deleted: (at-robot loc-x2-y3)
   added: (at-robot loc-x3-y3)
   goals met: 9 of 15
31. (move loc-x3-y3 loc-x3-y4)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x3-y4)
   goals met: 9 of 15
32. (move loc-x3-y4 loc-x4-y4)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x4-y4)
   goals met: 9 of 15
33. (visit loc-x4-y4)
   added: (visited loc-x4-y4)
   goals met: 10 of 15
34. (move loc-x4-y4 loc-x3-y4)
   deleted: (at-robot loc-x4-y4)
   added: (at-robot loc-x3-y4)
   goals met: 10 of 15
35. (visit loc-x3-y4)
   added: (visited loc-x3-y4)
   goals met: 11 of 15
36. (move loc-x3-y4 loc-x3-y3)
   deleted: (at-robot loc-x3-y4)
   added: (at-robot loc-x3-y3)
   goals met: 11 of 15
37. (move loc-x3-y3 loc-x3-y2)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x3-y2)
   goals met: 11 of 15
38. (move loc-x3-y2 loc-x2-y2)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x2-y2)
   goals met: 11 of 15
39. (move loc-x2-y2 loc-x2-y1)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x2-y1)
   goals met: 11 of 15
40. (move loc-x2-y1 loc-x1-y1)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x1-y1)
   goals met: 11 of 15
41. (move loc-x1-y1 loc-x1-y0)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y0)
   goals met: 11 of 15
42. (visit loc-x1-y0)
   added: (visited loc-x1-y0)
   goals met: 12 of 15
43. (move loc-x1-y0 loc-x0-y0)
   deleted: (at-robot loc-x1-y0)
   added: (at-robot loc-x0-y0)
   goals met: 12 of 15
44. (visit loc-x0-y0)
   added: (visited loc-x0-y0)
   goals met: 13 of 15
45. (move loc-x0-y0 loc-x1-y0)
   deleted: (at-robot loc-x0-y0)
   added: (at-robot loc-x1-y0)
   goals met: 13 of 15
46. (move loc-x1-y0 loc-x2-y0)
   deleted: (at-robot loc-x1-y0)
   added: (at-robot loc-x2-y0)
   goals met: 13 of 15
47. (move loc-x2-y0 loc-x2-y1)
   deleted: (at-robot loc-x2-y0)
   added: (at-robot loc-x2-y1)
   goals met: 13 of 15
48. (move loc-x2-y1 loc-x3-y1)
   deleted: (at-robot loc-x2-y1)
   added: (at-robot loc-x3-y1)
   goals met: 13 of 15
49. (move loc-x3-y1 loc-x3-y2)
   deleted: (at-robot loc-x3-y1)
   added: (at-robot loc-x3-y2)
   goals met: 13 of 15
50. (visit loc-x3-y2)
   added: (visited loc-x3-y2)
   goals met: 14 of 15
51. (move loc-x3-y2 loc-x4-y2)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x4-y2)
   goals met: 14 of 15
52. (move loc-x4-y2 loc-x4-y3)
   deleted: (at-robot loc-x4-y2)
   added: (at-robot loc-x4-y3)
   goals met: 14 of 15
53. (visit loc-x4-y3)
   added: (visited loc-x4-y3)
   goals met: 15 of 15
